
from jax import jit
#=============================================================================
# 積分点の情報を管理するクラス
#=============================================================================
class EvaluatePoint:
    #---------------------------------------------------------------------
    # コンストラクタ
    #---------------------------------------------------------------------
    @jit
    def __init__(self, id, coordinate, weight):
        self.id = id
        self.coordinaite = coordinate
        self.weight = weight